Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/law_enforcement/monitoring_sex_offenders_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Monitoring sex offenders in Ireland
ga: Ag déanamh monatóireachta ar chiontóirí gnéis in Éirinn

source: Upon conviction of a sexual offence, the court is required to issue a certificate, stating the offence, to the Gardaí, the convicted offender and the governor of the facility where the offender is to be detained
ga: Nuair a chiontaítear duine i cion gnéis, caithfidh an chúirt teastas a eisiúint ag leagan amach an chiona, leis na Gardaí, leis an gciontóir ciontaithe agus le gobharnóir na saoráide ina gcoinneofar an ciontóir

source: The certificate also sets out the sentence received and the fact that the person has become subject to a reporting requirement
ga: Leagann an teastas amach an phianbhreith a fuarthas agus go bhfuil an duine faoi réir riachtanas tuairiscithe

source: The court issues this certificate on behalf of the Gardaí to the Domestic Violence and Sexual Assault Unit
ga: Eisíonn an chúirt an teastas seo ar son na nGardaí chuig Aonad Foréigin Teaghlaigh agus Ionsaí Gnéis

source: This means that details of everyone subject to the requirements of the Sex Offenders Act 2001 are given to the Domestic Violence and Sex Assault Unit who keep a record of each individual by way of the court certificate (commonly known as the Sex Offenders Register)
ga: Ciallaíonn sé seo go dtugtar sonraí gach duine atá faoi réir riachtanais an Acht na gCiontóirí Gnéis 2001 don Aonad Foréigin Teaghlaigh agus Ionsaí Gnéis a choinníonn taifead ar gach duine trí mheán an teastais chúirte (ar a dtugtar go coitianta Clár na gCiontóirí Gnéis)

source: This information is then cross-referenced with the Sex Offenders Notification Form supplied by the local Garda Station and in this way the sex offenders may be monitored
ga: Déantar tras-tagairt idir an fhaisnéis seo agus Foirm Faisnéisithe Ciontóirí Gnéis a sholáthraíonn an Stáisiún áitiúil Gardaí agus ar an dóigh seo is féidir monatóireacht a dhéanamh ar na ciontóirí gnéis

source: At a local level the Gardaí, through nominated Inspectors, regularly make enquiries to ensure that the sex offenders in the local district are still residing at the address given in the notification form and that all the information contained in the notification form is accurate and up to date
ga: Ar leibhéal áitiúil déanfaidh na Gardaí fiosrúcháin go rialta, trí Chigirí ainmnithe, lena chinntiú go bhfuil ciontóirí gnéis sa cheantar áitiúil fós ina gcónaí ag an seoladh a tugadh san fhoirm faisnéisithe agus go bhfuil an fhaisnéis go léir san fhoirm faisnéisithe beacht agus suas le dáta

source: A nominated Inspector in each Garda Division has responsibility for liaising with the central Garda Domestic Violence and Sexual Assault Unit for the purpose of monitoring the application of the Sex Offenders Act 2001 in general
ga: Tá Cigire ainmnithe i ngach rannán Gardaí freagrach as idirchaidreamh a dhéanamh le hAonad lárnach Foréigin Teaghlaigh agus Ionsaí Gnéis an Gharda chun críche monatóireacht a dhéanamh ar chur i bhfeidhm an Achta um Chiontóirí Gnéis 2001 go ginearálta

source: When a court convicts someone of a qualifying sexual offence it is obliged when sentencing the offender to consider whether or not to impose a sentence involving post-release supervision. In doing so the court must take the following into account:
ga: Nuair a chiontaíonn cúirt duine as cion cáilitheach gnéis tá oibleagáid ar an gcúirt nuair a chiontaíonn sí an ciontóir breithniú a dhéanamh an ngearrfaidh siad pianbhreith ar an gciontóir a mbeidh maoirseacht iarscaoilte mar chuid de:

source: • The need for a period of post-release supervision of the offender
ga: • An riachtanas le tréimhse maoirseachta iarscaoilte

source: • The need to protect the public from serious harm from the offender
ga: • An riachtanas an pobal a chosaint ó mhórdhíobhail ón gciontóir

source: • The need to prevent the commission of further sexual offences by the offender
ga: • An riachtanas cionta gnéis eile a dhéanfadh an ciontóir a chosc

source: • The need to rehabilitate or further rehabilitate the offender
ga: • An riachtanas an ciontóir a athshlánú nó a athshlánú níos mó

source: In deciding whether or not to impose a sentence involving post-release supervision the court may hear evidence or submissions from any concerned person
ga: Déanfaidh an tSeirbhís Phromhaidh maoirseacht ar aon tréimhse maoirseachta iarscaoilte a ghearrfaidh an chúirt ar an gciontóir gnéis

source: Any period of post-release supervision imposed on the sex offender by the court will be supervised by the Probation Service which liaises with the Gardaí in order to ensure the sex offender complies with the supervision order
ga: Déanann an tSeirbhís Phromhaidh idirchaidreamh leis na Gardaí lena chinntiú go gcomhlíonann an ciontóir gnéis an t-ordú maoirseachta

source: Examples of conditions which the court may include in the order of supervision are:
ga: Is é seo a leanas roinnt samplaí de na coinníollacha ar féidir leis an gcúirt a chur isteach san ordú maoirseachta:

source: • Prohibiting the sex offender from attending certain places, such as schools, sports-clubs and play-grounds
ga: • Toirmeasc a chur ar an gciontóir gnéis dul chuig áiteanna áirithe, amhail scoileanna, clubanna spóirt agus láithreáin súgartha

source: • Requiring the sex offender to receive psychological counselling or other appropriate treatment during the period of supervision
ga: • Ag cur riachtanais ar an gciontóir gnéis comhairleoireacht shíceolaíoch a fháil nó cóireáil chuí eile le linn thréimhse na maoirseachta

source: If a sex offender fails or refuses to comply, without reasonable excuse, with the requirements relating to supervision, the offender is committing an offence and is liable, on summary conviction, to a class C fine or to imprisonment for a maximum of 12 months, or both
ga: Mura gcomhlíonann ciontóir gnéis na riachtanais maidir le maoirseacht nó má dhiúltaíonn an ciontóir iad a chomhlíonadh, tá an ciontóir ag déanamh ciona agus má chiontaítear é is féidir leis a bheith faoi dhliteanas fíneáil aicme C a fháil nó príosúnacht go ceann uasmhéide de 12 mhí, nó an dá rud

source: Monitoring sex offenders from other jurisdictions in Ireland
ga: Monatóireacht ar chiontóirí gnéis ó dhlínsí eile in Éirinn

source: A provision was included in the Sex Offenders Act, 2001 to ensure that Ireland would not become a safe-haven for sex offenders convicted outside Ireland who might seek to avoid the reporting requirements imposed on them by the place of conviction
ga: Cuireadh foráil isteach san Acht um Chiontóirí Gnéis, 2001, lena chinntiú nach ndéanfaí tearmann sábháilte d’Éirinn do chiontóirí gnéis a ciontaíodh lasmuigh d’Éirinn a d’fhéadfadh a bheith ag seachaint riachtanais tuairiscithe a gearradh orthu san áit ar ciontaíodh iad

source: Anyone who is convicted of a sexual offence in another country and who later moves to Ireland is subject to a reporting requirement in the same way as someone convicted in Ireland, provided that the sexual crime corresponds to a sexual crime in Ireland which gives rise to the reporting requirements
ga: Tá aon duine a chiontaítear as cion gnéis i dtír eile agus a aistríonn ina dhiaidh sin go hÉirinn faoi réir ag riachtanas tuairiscithe ar an dóigh chéanna le duine a ciontaíodh in Éirinn, ar an gcuntar go bhfuil an cion gnéis mar an gcéanna le cion gnéis in Éirinn a mbeadh riachtanais tuairiscithe ar an gciontóir mar gheall air

source: There is also a notification requirement where the person is already subject to a similar reporting requirement under the law of the place of conviction
ga: Tá riachtanas faisnéisithe chomh maith nuair a bhíonn an duine faoi réir ag riachtanas tuairiscithe den chineál céanna faoi dhlí na háite inar ciontaíodh iad

source: Such people are required to notify the Gardaí if they have been resident in Ireland for 7 days
ga: Tá riachtanas ar dhaoine dá leithéid na Gardaí a chur ar an eolas má bhí siad ina gcónaí in Éirinn ar feadh 7 lá

source: In reality the Gardaí in Ireland have a very good system of receiving and giving information from and to police forces through Interpol
ga: I bhfírinne tá córas an-mhaith ag na Gardaí in Éirinn le faisnéis a fháil ó agus a thabhairt do fhórsaí póilíní trí Interpol

source: There is worldwide acceptance that police forces have a duty of care to all citizens to share such information on sex offenders where there is a real danger to vulnerable people if exposed to such persons
ga: Glactar leis ar fud an domhain go bhfuil dualgas cúraim ar fhórsaí póilíní do gach saoránach faisnéis den sórt sin ar chiontóirí gnéis a roinnt nuair a bhíonn fíorchontúirt ann do dhaoine leochaileacha má bhíonn siad i dteagmháil le daoine den chineál sin gan chosaint

source: The Sex Offenders Act, 2001 also places requires sex offenders to inform prospective employers of the nature of their conviction when applying to do work that consists mainly of the offender having unsupervised access to or contact with a child or children or a mentally impaired person
ga: Cuireann an tAcht um Chiontóirí Gnéis, 2001 oibleagáid ar chiontóirí gnéis fostaitheoirí ionchasacha a chur in iúl faoi nádúr a gciontaithe nuair a chuireann siad iarratas isteach chun obair a dhéanamh ina mbeidh rochtain ag an gciontóir ar nó teagmháil ag an gciontóir le leanbh nó linbh nó le duine lagintinneach

source: If someone fails to notify an employer the offender could be fined up to €12,697 or sentenced up to 5 years in prison or both
ga: Mura gcuireann an ciontóir in iúl don fhostaitheoir thiocfaí fíneáil de suas le €12,697 a ghearradh air nó pianbhreith suas le 5 bliana i bpríosún, nó an dá rud

source: Can I find out if a sex offender lives in my area?
ga: An féidir liom a fháil amach an bhfuil ciontóir gnéis ina chónaí i mo cheantar?

source: The details held by the Gardaí in relation to those persons guilty of sex offences and who are subject to the requirements of the Sex Offenders Act 2001 are not subject to freedom of information legislation
ga: Níl na sonraí atá á gcoinneáil ag na Gardaí maidir leis na daoine sin atá ciontach as cionta gnéis agus atá faoi réir riachtanais an Achta um Chiontóirí Gnéis 2001, níl na sonraí sin faoi réir reachtaíocht ar saoráil faisnéise

source: You are not entitled, therefore, to apply under the Freedom of Information Acts to find out details of sex offenders living in your area
ga: Níl tú i dteideal, mar sin, iarratas a chur isteach faoi Achtanna um Shaoráil Faisnéise le sonraí ciontóirí gnéis atá ina gcónaí i do cheantar a fháil

source: Under the Data Protection Acts, 1988-2003 you are entitled to request information held about yourself on computer or in manual or paper files
ga: Faoi na hAchtanna um Chosaint Sonraí, 1988-2003 tá tú i dteideal faisnéis fút féin a iarraidh a choinnítear ar ríomhaire nó i gcomhaid láimhe nó páipéir

source: This includes information held by the Gardaí (with a number of exceptions)
ga: Cuimsíonn sé seo faisnéis a choinníonn na Gardaí (le roinnt eisceachtaí)

source: Under the data protection legislation, however, the only person entitled to request this information held about you is yourself
ga: Faoin reachtaíocht chosanta sonraí, áfach, is tusa an t-aon duine atá i dteideal an fhaisnéis seo a choinnítear fút féin a iarraidh

source: It is not possible for you to make such a request in respect of another person
ga: Ní féidir leat iarratas mar sin a dhéanamh maidir le duine eile

source: Further information on Data Protection in Ireland is available here
ga: Tá níos mó faisnéise ar Cosaint Sonraí in Éirinn ar fáil anseo
